Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཐོས་ཤིང་རྙེད་ནས་ཀྱང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་བོར་ཞིང་སྤངས་ཏེ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་ལྡན་པའི་མདོ་སྡེ་དག་ལས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་བཙལ་བར་སེམས་པ་བྱུང་ན། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་མཁས་པའི་ངང་ཚུལ་ཅན་ཡིན་ནམ།
en: In the same way, Subhūti,” continued the Blessed One, “in the future, if there are any noble sons or noble daughters who follow the vehicle of the bodhisattvas, and who, even after hearing and finding this profound perfection of wisdom, were to discard and abandon this profound perfection of wisdom, and think of looking for all-aspect omniscience in sūtras associated with the śrāvakas and the pratyekabuddhas, do you think, Subhūti, that those noble sons or noble daughters who follow the vehicle of the bodhisattvas would be intelligent?” “

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། སྐྱེས་བུ་ལ་ལ་ཞིག་གིས་ནོར་བུ་རིན་པོ་ཆེ་རིན་ཐང་མེད་པ་རྙེད་ནས། ནོར་བུ་མཆིང་བུ་དང་བསྒྲུན་པར་བསམས་ན།
en: Subhūti, it is as if someone, after finding a priceless precious gem, were to think it comparable to quartz.

source: བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་བཞིན་དུ། མ་འོངས་པའི་དུས་ན།
en: No, Blessed Lord!” “

source: བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཐོས་ཤིང་རྙེད་ནས་ཀྱང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་བོར་ཞིང་སྤངས་ཏེ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་ལྡན་པའི་མདོ་སྡེ་དག་ལས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་བཙལ་བར་སེམས་པ་འབྱུང་ན། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་བའི་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་མཁས་པའི་ངང་ཚུལ་ཅན་ཡིན་ནམ།
en: In the same way, Subhūti,” continued the Blessed One, “in the future, if there are any noble sons or noble daughters who follow the vehicle of the bodhisattvas, and who, even after hearing and finding this profound perfection of wisdom, were to discard and abandon this profound perfection of wisdom, and think of looking for all-aspect omniscience in sūtras associated with the śrāvakas and the pratyekabuddhas, do you think, Subhūti, that those noble sons or noble daughters who follow the vehicle of the bodhisattvas would be intelligent?” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ཡང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བདུད་ཀྱི་ལས་སུ་རིག་པར་བྱའོ། །རབ་འབྱོར་གཞན་ཡང་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་བའི་ཚེ། སྤོབས་པ་མང་པོ་གང་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་བའི་དཀྲུགས་མར་འགྱུར་བ་དེ་ལྟ་བུ་སྐྱེ་བར་འགྱུར་བ་འདི་ལྟར།
en: Subhūti,” continued the Blessed One, “bodhisattva great beings should know that this too is the work of Māra. “

source: གཟུགས་ཀྱི་སྤོབས་པ་དང་། སྒྲ་དང་དྲི་དང་རོ་དང་རེག་དང་ཆོས་ཀྱི་སྤོབས་པ་དང་། སྦྱིན་པའི་སྤོབས་པ་དང་། ཚུལ་ཁྲིམས་དང་བཟོད་པ་དང་བརྩོན་འགྲུས་དང་བསམ་གཏན་དང་ཤེས་རབ་ཀྱི་སྤོབས་པ་དང་། འདོད་པའི་ཁམས་ཀྱི་སྤོབས་པ་དང་། གཟུགས་ཀྱི་ཁམས་ཀྱི་སྤོབས་པ་དང་། གཟུགས་མེད་པའི་ཁམས་ཀྱི་སྤོབས་པ་དང་། ལུད་དཔོག་པ་དང་། ཁ་ཏོན་དུ་བྱ་བའི་སྤོབས་པ་དང་། རིམ་གྲོར་བྱ་བའི་སྤོབས་པ་དང་། དྲན་པ་ཉེ་བར་གཞག་པའི་སྤོབས་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་ལམ་གྱི་སྤོབས་པ་དང་བསམ་གཏན་དང་རྣམ་པར་ཐར་པ་དང་ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པའི་སྤོབས་པ་དང་། ནང་སྟོང་པ་ཉིད་ཀྱི་སྤོབས་པ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་སྤོབས་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་སྤོབས་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་སྤོབས་པ་དང་། སྟོབས་དང་མི་འཇིགས་པ་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་སྤོབས་པ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་གྱི་སྤོབས་པ་སྐྱེ་བར་འགྱུར་རོ།
en: Moreover, Subhūti, when those noble sons and noble daughters commit this profound perfection of wisdom to writing, the following will arise to disturb their writing of this profound perfection of wisdom: inspired speech associated with sights; inspired speech associated with sounds, odors, tastes, tangibles, and mental phenomena; inspired speech associated with generosity; inspired speech associated with ethical discipline, tolerance, perseverance, meditative concentration, and wisdom; inspired speech associated with the realm of desire; inspired speech associated with the realm of form; inspired speech associated with the realm of formlessness; inspired speech associated with the conferral of transmissions and acts of dissemination; inspired speech associated with acts of service; inspired speech associated with the applications of mindfulness; inspired speech associated with the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the path; inspired speech associated with the meditative concentrations, the aspects of liberation, the meditative stabilities and the formless absorptions; inspired speech associated with the emptiness of internal phenomena; inspired speech associated with [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities; inspired speech associated with the perfection of generosity; inspired speech associated with the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom; inspired speech associated with the powers [of the tathāgatas], the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas; and inspired speech associated with [the goals], up to and including unsurpassed, complete enlightenment.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་སྤོབས་པ་མེད་པས་རྣམ་པར་བྱང་བའོ།
en: If you ask why, Subhūti, it is because the perfection of wisdom is purified of inspired speech. “

source: །རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་བསམ་གྱིས་མི་ཁྱབ་པའོ།
en: Subhūti, the perfection of wisdom is inconceivable.

source: །རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་སེམས་མེད་པའོ།
en: Subhūti, the perfection of wisdom is unimaginable.

source: །རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་སྐྱེ་བ་མེད་ཅིང་འགག་པ་མེད་པའོ།
en: Subhūti, the perfection of wisdom neither arises nor ceases.

source: །རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཀུན་ནས་ཉོན་མོངས་པ་མེད་ཅིང་རྣམ་པར་བྱང་བ་མེད་པའོ།
en: Subhūti, the perfection of wisdom is neither afflicted nor purified. {

source: །རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་འཁྲུག་པ་མེད་པའོ།
en: Ki.IV: 41} Subhūti, the perfection of wisdom is undisturbed.

source: །རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་བརྗོད་དུ་མེད་པའོ།
en: Subhūti, the perfection of wisdom is inexpressible.

source: །རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་རྣམ་པར་བྱང་བ་མེད་པའོ།
en: Subhūti, the perfection of wisdom is not to be refined.

source: །རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་དམིགས་པ་མེད་པའོ།
en: Subhūti, the perfection of wisdom is nonapprehensible.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཆོས་དེ་དག་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་མེད་ཅིང་མི་དམིགས་ཏེ།
en: If you ask why, Subhūti, these attributes do not exist and are not apprehended in this profound perfection of wisdom.

source: རབ་འབྱོར་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་བའི་ཚེ། ཆོས་དེ་དག་གིས་འཁྲུག་པར་གྱུར་ན། རབ་འབྱོར་དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་གི་བདུད་ཀྱི་ལས་སུ་རིག་པར་བྱའོ།
en: Subhūti, if, when noble sons or noble daughters who follow the vehicle of the bodhisattvas commit this profound perfection of wisdom to writing, they are disturbed by these attributes, then, Subhūti, those noble sons or noble daughters who follow the vehicle of the bodhisattvas should know that this too is the work of Māra.”

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བྲི་བར་ནུས་ལགས་སམ།
en: The venerable Subhūti then asked the Blessed One, “Blessed Lord, can the perfection of wisdom be committed to writing?” “

source: རབ་འབྱོར་དེ་ལྟ་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ངོ་བོ་ཉིད་ཡོད་པ་མ་ཡིན་ཏེ་མི་དམིགས་སོ།
en: If you ask why, Subhūti, the essential nature of the perfection of wisdom does not exist, and it is not apprehended.

source: །བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ངོ་བོ་ཉིད་ཡོད་པ་མ་ཡིན་ཏེ་མི་དམིགས་སོ།
en: The essential nature of the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity does not exist, and it is not apprehended.

source: །སྟོང་པ་ཉིད་ཐམས་ཅད་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་གྱི་ངོ་བོ་ཉིད་ཡོད་པ་མ་ཡིན་ཏེ། མི་དམིགས་སོ།
en: The essential nature of all the aspects of emptiness and the thirty-seven factors conducive to enlightenment does not exist, and it is not apprehended.

source: །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་ཚད་མེད་པ་རྣམས་དང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་རྣམས་ཀྱི་ངོ་བོ་ཉིད་ཡོད་པ་མ་ཡིན་ཏེ་མི་དམིགས་སོ།
en: The essential nature of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers does not exist, and it is not apprehended.

source: །ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱི་ངོ་བོ་ཉིད་ཡོད་པ་མ་ཡིན་ཏེ་མི་དམིགས་སོ།
en: The essential nature of the meditative stabilities and the dhāraṇī gateways does not exist, and it is not apprehended.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་ངོ་བོ་ཉིད་ཡོད་པ་མ་ཡིན་ཏེ་མི་དམིགས་སོ།
en: The essential nature of the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the distinct qualities does not exist, and it is not apprehended.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་ངོ་བོ་ཉིད་ཡོད་པ་མ་ཡིན་ཏེ་མི་དམིགས་སོ།
en: The essential nature of [the goals], up to and including all-aspect omniscience, does not exist, and it is not apprehended.

source: །ངོ་བོ་ཉིད་མི་དམིགས་པ་གང་ཡིན་པ་དེ་ནི་དངོས་པོ་མེད་པའོ།
en: That which is a nonapprehensible essential nature is a nonentity.

source: །དངོས་པོ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: That which is a nonentity is the perfection of wisdom.

source: དངོས་པོ་མེད་པས་དངོས་པོ་མེད་པ་བྲི་བར་མི་ནུས་སོ།
en: A nonentity cannot be committed to writing because it is a nonentity. “

source: །རབ་འབྱོར་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་འདི་དངོས་པོ་མེད་ཅེས་བྱ་བར་འདུ་ཤེས་ན། དེ་ཡང་བདུད་ཀྱི་ལས་སུ་རིག་པར་བྱའོ། །གསོལ་པ།
en: Subhūti, if any noble sons or noble daughters who follow the vehicle of the bodhisattvas perceive that this profound perfection of wisdom is a nonentity, that too should be known as the work of Māra.” “

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཡི་གེར་བྲིས་ནས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་བདག་གིས་བྲིས་སོ་ཞེས་མཆི་ན། དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་ཡི་གེར་མངོན་པར་ཆགས་པ་ལགས་ཏེ།
en: Blessed Lord, if any noble sons or noble daughters who follow the vehicle of the bodhisattvas, after committing this profound perfection of wisdom to writing, discern that they themselves have committed this profound perfection of wisdom to writing, then they are attached to of this profound perfection of wisdom as written.

source: བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཡི་གེ་མ་མཆིས་པའོ།
en: Blessed Lord, the perfection of wisdom is unwritten.

source: །བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཡི་གེ་མ་མཆིས་པའོ།
en: The perfection of meditative concentration is unwritten. {Ki.

source: །བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཡི་གེ་མ་མཆིས་པའོ།
en: IV: 42} The perfection of perseverance is unwritten.

source: །བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཡི་གེ་མ་མཆིས་པའོ།
en: The perfection of tolerance is unwritten.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཡི་གེ་མ་མཆིས་པའོ།
en: The perfection of ethical discipline is unwritten.

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཡི་གེ་མ་མཆིས་པའོ། །གསོལ་པ།
en: The perfection of generosity is unwritten. “

source: བཅོམ་ལྡན་འདས་གཟུགས་ནི་ཡི་གེ་མ་མཆིས་པའོ།
en: Blessed Lord, physical forms are unwritten.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ནི་ཡི་གེ་མ་མཆིས་པའོ།
en: Feelings, perceptions, formative predispositions, and consciousness are unwritten.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ནི་ཡི་གེ་མ་མཆིས་པའོ།
en: The sense fields, the sensory elements, and the links of dependent origination are unwritten.

source: །ནང་སྟོང་པ་ཉིད་ནི་ཡི་གེ་མ་མཆིས་པའོ།
en: The emptiness of internal phenomena is unwritten. [

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་ནི་ཡི་གེ་མ་མཆིས་པའོ།
en: The other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are unwritten.

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ནི་ཡི་གེ་མ་མཆིས་པའོ།
en: The thirty-seven factors conducive to enlightenment are unwritten.

source: །འཕགས་པའི་བདེན་པ་རྣམས་དང་བསམ་གཏན་རྣམས་དང་ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་ནི་ཡི་གེ་མ་མཆིས་པའོ།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers are unwritten.

source: །ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ནི་ཡི་གེ་མ་མཆིས་པའོ།
en: The meditative stabilities and the dhāraṇī gateways are unwritten.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་མི་འཇིགས་པ་རྣམས་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ནི་ཡི་གེ་མ་མཆིས་པའོ།
en: The powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the eighteen distinct qualities of the buddhas are unwritten. [

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ནི་ཡི་གེ་མ་མཆིས་པའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་ཡི་གེ་མ་མཆིས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མངོན་པར་ཆགས་པར་བགྱིད་ལ། ཡི་གེ་མ་མཆིས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་མངོན་པར་ཆགས་པར་བགྱིད་པ་དང་། ཡི་གེ་མ་མཆིས་པའི་ནང་སྟོང་པ་ཉིད་ལ་མངོན་པར་ཆགས་པར་བགྱིད་པ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་མངོན་པར་ཆགས་པར་བགྱིད་པ་དང་། ཡི་གེ་མ་མཆིས་པའི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་མངོན་པར་ཆགས་པར་བགྱིད་པ་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་།
en: The goals], up to and including all-aspect omniscience, are unwritten. “

source: སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་ལ་མངོན་པར་ཆགས་པར་བགྱིད་པ་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་མངོན་པར་ཆགས་པར་བགྱིད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལ་མངོན་པར་ཆགས་པར་བགྱིད་པ་དང་། ཡི་གེ་མ་མཆིས་པའི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་མངོན་པར་ཆགས་པར་བགྱིད་ན། དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བདུད་ཀྱི་ལས་སུ་རིག་པར་བགྱིའོ།
en: Blessed Lord, if noble sons or noble daughters who follow the vehicle of the bodhisattvas are attached to the unwritten perfection of wisdom, and if they are attached to the unwritten perfection of meditative concentration, perfection of perseverance, perfection of tolerance, perfection of ethical discipline, or perfection of generosity; if they are attached to the unwritten emptiness of internal phenomena; if they are attached to the [unwritten other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities; if they are attached to the unwritten thirty-seven factors conducive to enlightenment; if they are attached to the [unwritten] truths of the noble ones, meditative concentrations, immeasurable attitudes, formless absorptions, eight aspects of liberation, nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, or the extrasensory powers; if they are attached to the [unwritten] meditative stabilities or dhāraṇī gateways; if they are attached to the [unwritten] powers of the tathāgatas, fearlessnesses, kinds of exact knowledge, or distinct qualities of the buddhas; and if they are attached to the unwritten [goals], up to and including all-aspect omniscience, then bodhisattva great beings should know that this too is the work of Māra.” “

source: དེ་དེ་བཞིན་ནོ། །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་བ་དང་།
en: It is so!”

source: ཁ་ཏོན་བྱེད་པ་དང་།
en: said the Blessed One. “

source: ཞུ་བ་དང་འཛིན་པ་དང་ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དང་། སྒོམ་པའི་ཚེ་ཡུལ་གྱི་ཡིད་ལ་བྱ་བ་མང་པོ་སྐྱེད་ན། རབ་འབྱོར་དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བདུད་ཀྱི་ལས་སུ་རིག་པར་བྱའོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་བཞི་བཅུ་བཞི་པ།
en: Moreover, Subhūti, when bodhisattva great beings commit this profound perfection of wisdom to writing, and disseminate, request, take up, recite, master, focus their attention correctly on it, and cultivate it, if they pay a lot of attention to their country, then, Subhūti, bodhisattva great beings should know that this too is the work of Māra. “

source: རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་བ་དང་ཁ་ཏོན་བྱ་བ་དང་། ཞུ་བ་དང་འཛིན་པ་དང་ཀློག་པ་དང་ཀུན་ཆུབ་པར་བྱེད་པ་དང་ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དང་། སྒོམ་པའི་ཚེ་གྲོང་གི་ཡིད་ལ་བྱ་བ་དང་། གྲོང་རྡལ་གྱི་ཡིད་ལ་བྱ་བ་དང་ཁམས་ཀྱི་ཡིད་ལ་བྱ་བ་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་གྱི་ཡིད་ལ་བྱ་བ་དང་ཁྱིམ་གྱི་ཡིད་ལ་བྱ་བ་དང་། མཁན་པོའི་ཡིད་ལ་བྱ་བ་དང་། ཕ་དང་མ་དང་ཕུ་ནུ་དང་སྲིང་མོ་དང་། གཉེན་བཤེས་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བ་དང་། རྐུན་པོ་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བ་དང་། ཕྱག་དར་བ་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བ་དང་། འཇིག་རྟེན་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བ་དང་། སྟུ་འཚོང་མ་དང་ལྡན་པ་དང་། བུད་མེད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བ་དང་། ཡིད་ལ་བྱ་བ་གཞན་མང་པོ་སྐྱེ་ན། རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་བ་དང་འཆང་བ་དང་ཀློག་པ་དང་ལུང་འབོག་པ་དང་ཁ་ཏོན་བྱེད་པ་དང་ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པའི་ཚེ།
en: Moreover, Subhūti, when noble sons or noble daughters who follow the vehicle of the bodhisattvas are committing this profound perfection of wisdom to writing, and disseminating, requesting, holding, reciting, mastering, cultivating, or focusing their attention correctly on it, if while cultivating it they focus attention on villages, focus attention on market towns, focus attention on nations, focus attention on capital cities, focus attention on households, focus attention on monastic preceptors, focus attention on parents, brothers, sisters, or friends, focus attention on thieves, focus attention on scavengers, focus attention on worldly people, focus attention on prostitutes, or focus attention on women, or if their attention should happen to be focused on all sorts of other matters, then, Subhūti, while they are committing this profound perfection of wisdom to writing, and holding, reciting, transmitting, disseminating, or focusing their attention correctly on this profound perfection of wisdom, {Ki.

source: བར་ཆད་བྱ་བའི་ཕྱིར་བདུད་སྡིག་ཏོ་ཅན་འཁྲུག་པར་འགྱུར་བ་ཉེ་བར་སྦྱོར་ཏེ།
en: IV: 43} the evil Māra will provoke disturbances in order to make obstacles.

source: དེ་དག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བདུད་ཀྱི་ལས་སུ་རིག་པར་བྱའོ། །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་བའི་ཚེ། ཁེ་དང་བཀུར་བསྟི་དང་།
en: Bodhisattva great beings should know that these too are the work of Māra. “

source: ཚིགས་སུ་བཅད་པ་དང་ཆོས་གོས་དང་ཟས་དང་མལ་ཆ་དང་། ནད་ཀྱི་རྐྱེན་རྩི་དང་ཡོ་བྱད་མང་པོ་བྱུང་ལ། བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་བ་དང་། ལུང་འབོག་པ་དང་ཁ་ཏོན་བྱེད་པ་དང་ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པའི་ཚེ། དེ་དག་གི་རོ་མྱོང་བར་བྱེད་ན། རབ་འབྱོར་དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བདུད་ཀྱི་ལས་སུ་རིག་པར་བྱ་སྟེ།
en: Moreover, Subhūti, when noble sons or noble daughters who follow the vehicle of the bodhisattvas commit this profound perfection of wisdom to writing, while they are committing this profound perfection of wisdom to writing, and transmitting, disseminating, or focusing their attention correctly on it, if they should relish profit, honors, words [of praise], religious robes, food, bedding, medicines, or many utensils, then, Subhūti, bodhisattva great beings should know that these too are the work of Māra.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་བ་དང་ལུང་འབོག་པ་དང་ཁ་ཏོན་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པའི་ཚེ། བར་ཆད་དེ་ལྟ་བུ་དག་འབྱུང་བར་འགྱུར་རོ།
en: Such obstacles will arise while they are committing this profound perfection of wisdom to writing, and transmitting, disseminating, or focusing their attention correctly on it. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་བ་དང་ལུང་འབོག་པ་དང་ཁ་ཏོན་བྱེད་པ་དང་ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དང་སྒོམ་པའི་ཚེ། བདུད་སྡིག་ཏོ་ཅན་དག་མདོ་སྡེ་ཟབ་མོ་གང་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་ལྡན་པ་དྲན་པ་ཉེ་བར་བཞག་པ་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དག་ཉེ་བར་བསྙེན་པར་བྱེད་དེ།
en: Moreover, Subhūti, when bodhisattva great beings are committing this profound perfection of wisdom to writing, and transmitting, disseminating, cultivating, or focusing their attention correctly on it, the evil Māra will suggest profound sūtras associated with the śrāvakas and pratyekabuddhas that promote the applications of mindfulness, and [the other causal attributes], up to and including the noble eightfold path, as well as the gateways to liberation—emptiness, signlessness, and wishlessness.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོས་ཐབས་མཁས་པས་བདུད་ཀྱིས་བསྙེན་པའི་མདོ་སྡེ་ཟབ་མོ་དེ་དག་ལ་འདོད་པ་མི་བསྐྱེད་དོ།
en: In that case, noble sons and noble daughters who follow the vehicle of the bodhisattvas and who are endowed with skillful means will not be attracted to those profound sūtras suggested by Māra.

source: །རབ་འབྱོར་དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་དག་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱེད་པ་མ་ཡིན་ནོ།
en: If you ask why, Subhūti, these are not conducive to the attainment of all-aspect omniscience.

source: །རབ་འབྱོར་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཐབས་མི་མཁས་པ་དག་ནི། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཐབ་མོ་འདི་ཐོས་ནས་སྤང་བར་སེམས་ཏེ། དེ་ལ་ངས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཐབས་མཁས་པ་ཡང་རྒྱ་ཆེར་བསྟན་ཏེ།
en: Subhūti, bodhisattvas who are unskilled in it will think of discarding this profound perfection of wisdom after hearing it, but in it I have extensively revealed skillful means to bodhisattva great beings.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལས་ཀྱང་། ཐབས་མཁས་པ་རྒྱ་ཆེར་བཙལ་བར་བྱའོ།
en: Skillful means can indeed be extensively found in this profound perfection of wisdom.
